In [7]:
import numpy as np
import pandas as pd

## Series / Seriler
- numpy dizileri,sözlükler,listelerden oluşturulabilir

In [8]:
sozlugum = {"Ahmet":40 ,"Şerife":30, "Tuğçe":25}

In [9]:
pd.Series(sozlugum) # Seri oluştu, type'ı pandas series

Ahmet     40
Şerife    30
Tuğçe     25
dtype: int64

In [10]:
Yaslar = [56,77,90]
Isimler = ["Ahmet", "Şerife", "Tuğçe"]

In [11]:
pd.Series(Yaslar, Isimler)

Ahmet     56
Şerife    77
Tuğçe     90
dtype: int64

In [12]:
pd.Series(data = Yaslar, index = Isimler) # Bu şekilde de ifade edilir.

Ahmet     56
Şerife    77
Tuğçe     90
dtype: int64

In [13]:
numpyDizisi = np.array([50,40,30])

In [14]:
numpyDizisi

array([50, 40, 30])

In [15]:
pd.Series(numpyDizisi)

0    50
1    40
2    30
dtype: int32

In [16]:
pd.Series(numpyDizisi, Isimler)

Ahmet     50
Şerife    40
Tuğçe     30
dtype: int32

In [17]:
pd.Series(["Ferrarı","Bugatti","Ford"],[1,2,3]) # indexleri int yaptık ve değiştirdik.

1    Ferrarı
2    Bugatti
3       Ford
dtype: object

In [18]:
yarismaSonucu = pd.Series([10,5,3],["Tuğçe","İrem","Osman"])

In [19]:
yarismaSonucu

Tuğçe    10
İrem      5
Osman     3
dtype: int64

In [20]:
yarismaSonucu2 = pd.Series([20,9,18],["Tuğçe","İrem","Osman"])

In [21]:
yarismaSonucu2

Tuğçe    20
İrem      9
Osman    18
dtype: int64

In [22]:
yarismaSonucu2["İrem"]

9

In [23]:
sonSonuc = yarismaSonucu + yarismaSonucu2 # Serileri kullanarak bu tarz kolaylıklar yapabiliyoruz.

In [24]:
sonSonuc

Tuğçe    30
İrem     14
Osman    21
dtype: int64

# DataFrame

In [25]:
import pandas as pd
import numpy as np

In [26]:
data = np.random.randn(4,3)

In [27]:
data

array([[ 1.16507401,  0.80815302,  0.53601201],
       [-1.46002363, -0.88206408, -0.65544041],
       [ 1.69008101,  0.84750085, -0.77844799],
       [ 0.27893335, -1.67789321,  1.14857491]])

In [28]:
dataFrame = pd.DataFrame(data)

In [29]:
dataFrame

          0         1         2
0  1.165074  0.808153  0.536012
1 -1.460024 -0.882064 -0.655440
2  1.690081  0.847501 -0.778448
3  0.278933 -1.677893  1.148575

In [30]:
type(dataFrame[0])

pandas.core.series.Series

In [31]:
yeniDataFrame = pd.DataFrame(data, index=["Tuğçe","Anıl","Mehmet","Yasin"], columns=["maas","yas","calısma saatleri"]) # indexlerle nasıl oynuyoruz?

In [32]:
yeniDataFrame

            maas       yas  calısma saatleri
Tuğçe   1.165074  0.808153          0.536012
Anıl   -1.460024 -0.882064         -0.655440
Mehmet  1.690081  0.847501         -0.778448
Yasin   0.278933 -1.677893          1.148575

In [33]:
yeniDataFrame["yas"]

Tuğçe     0.808153
Anıl     -0.882064
Mehmet    0.847501
Yasin    -1.677893
Name: yas, dtype: float64

In [34]:
yeniDataFrame["maas"]

Tuğçe     1.165074
Anıl     -1.460024
Mehmet    1.690081
Yasin     0.278933
Name: maas, dtype: float64

In [35]:
yeniDataFrame[["maas","yas"]]

            maas       yas
Tuğçe   1.165074  0.808153
Anıl   -1.460024 -0.882064
Mehmet  1.690081  0.847501
Yasin   0.278933 -1.677893

In [36]:
yeniDataFrame.loc["Tuğçe"] # loc = location dan istediğim kişinin değerini getirebiliyorum

maas                1.165074
yas                 0.808153
calısma saatleri    0.536012
Name: Tuğçe, dtype: float64

In [37]:
yeniDataFrame.iloc[0] # iloc = index location

maas                1.165074
yas                 0.808153
calısma saatleri    0.536012
Name: Tuğçe, dtype: float64

In [38]:
yeniDataFrame

            maas       yas  calısma saatleri
Tuğçe   1.165074  0.808153          0.536012
Anıl   -1.460024 -0.882064         -0.655440
Mehmet  1.690081  0.847501         -0.778448
Yasin   0.278933 -1.677893          1.148575

In [39]:
# Yanına kolon eklemek istesek nasıl yapıcaz?

In [40]:
yeniDataFrame["Emeklilik yasi"] = yeniDataFrame["yas"] + yeniDataFrame["yas"]

In [41]:
yeniDataFrame

            maas       yas  calısma saatleri  Emeklilik yasi
Tuğçe   1.165074  0.808153          0.536012        1.616306
Anıl   -1.460024 -0.882064         -0.655440       -1.764128
Mehmet  1.690081  0.847501         -0.778448        1.695002
Yasin   0.278933 -1.677893          1.148575       -3.355786

In [42]:
# Kolonu silmek istersek

In [43]:
yeniDataFrame.drop("Emeklilik yasi",axis = 1) # kolon sildik

            maas       yas  calısma saatleri
Tuğçe   1.165074  0.808153          0.536012
Anıl   -1.460024 -0.882064         -0.655440
Mehmet  1.690081  0.847501         -0.778448
Yasin   0.278933 -1.677893          1.148575

In [44]:
yeniDataFrame.drop("Yasin", axis = 0)

            maas       yas  calısma saatleri  Emeklilik yasi
Tuğçe   1.165074  0.808153          0.536012        1.616306
Anıl   -1.460024 -0.882064         -0.655440       -1.764128
Mehmet  1.690081  0.847501         -0.778448        1.695002

In [45]:
yeniDataFrame # Asıl dataframe'mizden düşmedi

            maas       yas  calısma saatleri  Emeklilik yasi
Tuğçe   1.165074  0.808153          0.536012        1.616306
Anıl   -1.460024 -0.882064         -0.655440       -1.764128
Mehmet  1.690081  0.847501         -0.778448        1.695002
Yasin   0.278933 -1.677893          1.148575       -3.355786

In [46]:
yeniDataFrame.drop("Emeklilik yasi", axis = 1, inplace = True) # inplace, orjinalinde değişiklik yapmamıza izin veriyor şu an tablo silindi

In [47]:
yeniDataFrame.loc["Tuğçe"]["yas"]

0.8081530214998938

In [48]:
yeniDataFrame.loc["Tuğçe","yas"]

0.8081530214998938

In [49]:
yeniDataFrame

            maas       yas  calısma saatleri
Tuğçe   1.165074  0.808153          0.536012
Anıl   -1.460024 -0.882064         -0.655440
Mehmet  1.690081  0.847501         -0.778448
Yasin   0.278933 -1.677893          1.148575

In [50]:
booleanFrame = yeniDataFrame < 0

In [51]:
booleanFrame

         maas    yas  calısma saatleri
Tuğçe   False  False             False
Anıl     True   True              True
Mehmet  False  False              True
Yasin   False   True             False

In [52]:
yeniDataFrame[booleanFrame] # 0 dan küçük değerleri gösterdi veya

            maas       yas  calısma saatleri
Tuğçe        NaN       NaN               NaN
Anıl   -1.460024 -0.882064         -0.655440
Mehmet       NaN       NaN         -0.778448
Yasin        NaN -1.677893               NaN

In [53]:
yeniDataFrame[yeniDataFrame < 0]

            maas       yas  calısma saatleri
Tuğçe        NaN       NaN               NaN
Anıl   -1.460024 -0.882064         -0.655440
Mehmet       NaN       NaN         -0.778448
Yasin        NaN -1.677893               NaN

In [54]:
yeniDataFrame[yeniDataFrame["yas"] > 0] # sadece pozitif rowları getir dedik

            maas       yas  calısma saatleri
Tuğçe   1.165074  0.808153          0.536012
Mehmet  1.690081  0.847501         -0.778448

In [55]:
yeniDataFrame

            maas       yas  calısma saatleri
Tuğçe   1.165074  0.808153          0.536012
Anıl   -1.460024 -0.882064         -0.655440
Mehmet  1.690081  0.847501         -0.778448
Yasin   0.278933 -1.677893          1.148575

In [56]:
# index değiştirmek istersek

In [57]:
yeniDataFrame.reset_index()

    index      maas       yas  calısma saatleri
0   Tuğçe  1.165074  0.808153          0.536012
1    Anıl -1.460024 -0.882064         -0.655440
2  Mehmet  1.690081  0.847501         -0.778448
3   Yasin  0.278933 -1.677893          1.148575

In [58]:
yeniDataFrame # inplace kullanmadığımızdan eski haline döner

            maas       yas  calısma saatleri
Tuğçe   1.165074  0.808153          0.536012
Anıl   -1.460024 -0.882064         -0.655440
Mehmet  1.690081  0.847501         -0.778448
Yasin   0.278933 -1.677893          1.148575

In [59]:
yeniIndexListesi = ["Tuğ","Anı","Meh","Yas"]

In [60]:
yeniDataFrame["Yeni Index"] = yeniIndexListesi

In [61]:
yeniDataFrame

            maas       yas  calısma saatleri Yeni Index
Tuğçe   1.165074  0.808153          0.536012        Tuğ
Anıl   -1.460024 -0.882064         -0.655440        Anı
Mehmet  1.690081  0.847501         -0.778448        Meh
Yasin   0.278933 -1.677893          1.148575        Yas

In [62]:
yeniDataFrame.set_index("Yeni Index", inplace = True)

In [63]:
yeniDataFrame

                maas       yas  calısma saatleri
Yeni Index
Tuğ         1.165074  0.808153          0.536012
Anı        -1.460024 -0.882064         -0.655440
Meh         1.690081  0.847501         -0.778448
Yas         0.278933 -1.677893          1.148575

# MultiIndex

In [70]:
ilkIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park","South Park"]

In [71]:
icIndexler = ["Homer","Bart","Merge","Cartman","Kenny","Kyle"]

In [72]:
birlesmisIndex = list(zip(ilkIndexler,icIndexler))

In [73]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Merge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [74]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [75]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Merge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [76]:
type(birlesmisIndex)

pandas.core.indexes.multi.MultiIndex

In [78]:
cizgiFİlmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [79]:
cizgiFilmNumpyDizim = np.array(cizgiFİlmListem)

In [80]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizim, index = birlesmisIndex, columns = ["Yas","Meslek"])

In [81]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Merge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [82]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Merge  30      C

In [83]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [84]:
cizgiFilmDataFrame.index.names = ["Film adı","İsim"]

In [85]:
cizgiFilmDataFrame

                   Yas Meslek
Film adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Merge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F